[Killed] BlockStatement
main/components/MenuItem/MenuItemTable.js:9:36
   const testid = "MenuItemTable";
   const navigate = useNavigate();
 
-  const reviewCallback = (cell) => {
-    const item = cell.row.original;
-    navigate(`/myreviews/create?itemId=${item.id}&itemName=${encodeURIComponent(item.name)}`);
-  };
+  const reviewCallback = (cell) => {};
 
   const columns = [
killedBy: MenuItemTable Tests Buttons work correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />
