[Killed] ArrowFunction
main/components/MyReviews/ReviewForm.js:45:32
           value={stars}
           onChange={(e) => setStars(Number(e.target.value))}
         >
-          {[1, 2, 3, 4, 5].map((num) => (
-            <option key={num} value={num}>{num}</option>
-          ))}
+          {[1, 2, 3, 4, 5].map(() => undefined)}
         </Form.Select>
       </Form.Group>
killedBy: ReviewForm tests renders form fields and calls submitAction
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "dateItemServed": "2024-04-01T10:00",
-   "itemsStars": 5,
