[Killed] BlockStatement
main/pages/MyReviews/MyReviewsCreatePage.js:14:44
   const itemName = searchParams.get("itemName");
   const navigate = useNavigate();
 
-  const submitReview = async (formData) => {
-    try {
-      await axios.post("/api/reviews/post", null, {
-        params: {
-          itemId,
-          reviewerComments: formData.reviewerComments,
-          itemsStars: formData.itemsStars,
-          dateItemServed: formData.dateItemServed,
-        },
-      });
-      toast(`Review submitted for ${itemName}`);
-      navigate("/myreviews");
-    } catch (err) {
-      toast.error(`Error submitting review: ${err.response?.data?.error || err.message}`);
-    }
-  };
+  const submitReview = async (formData) => {};
 
   return (
killedBy: MyReviewsCreatePage tests submits form and navigates on success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/MyReviews/MyReviewsCreatePage.js:15:9
   const navigate = useNavigate();
 
   const submitReview = async (formData) => {
-    try {
-      await axios.post("/api/reviews/post", null, {
-        params: {
-          itemId,
-          reviewerComments: formData.reviewerComments,
-          itemsStars: formData.itemsStars,
-          dateItemServed: formData.dateItemServed,
-        },
-      });
-      toast(`Review submitted for ${itemName}`);
-      navigate("/myreviews");
-    } catch (err) {
+    try {} catch (err) {
       toast.error(`Error submitting review: ${err.response?.data?.error || err.message}`);
     }
killedBy: MyReviewsCreatePage tests submits form and navigates on success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/MyReviews/MyReviewsCreatePage.js:25:16
         },
       });
       toast(`Review submitted for ${itemName}`);
-      navigate("/myreviews");
+      navigate("");
     } catch (err) {
       toast.error(`Error submitting review: ${err.response?.data?.error || err.message}`);
killedBy: MyReviewsCreatePage tests submits form and navigates on success
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/myreviews"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Survived] BlockStatement
main/pages/MyReviews/MyReviewsCreatePage.js:26:19
       });
       toast(`Review submitted for ${itemName}`);
       navigate("/myreviews");
-    } catch (err) {
-      toast.error(`Error submitting review: ${err.response?.data?.error || err.message}`);
-    }
+    } catch (err) {}
   };
 

[Survived] OptionalChaining
main/pages/MyReviews/MyReviewsCreatePage.js:27:47
       toast(`Review submitted for ${itemName}`);
       navigate("/myreviews");
     } catch (err) {
-      toast.error(`Error submitting review: ${err.response?.data?.error || err.message}`);
+      toast.error(`Error submitting review: ${err.response?.data.error || err.message}`);
     }
   };

[Survived] ConditionalExpression
main/pages/MyReviews/MyReviewsCreatePage.js:27:47
       toast(`Review submitted for ${itemName}`);
       navigate("/myreviews");
     } catch (err) {
-      toast.error(`Error submitting review: ${err.response?.data?.error || err.message}`);
+      toast.error(`Error submitting review: ${false}`);
     }
   };
