[Killed] BlockStatement
main/pages/Reviews/PostReviewPage.js:4:42
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 import { useParams } from "react-router-dom";
 
-export default function PostReviewPage() {
-  const { id } = useParams();
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Post a review for Menu Item {id}</h1>
-        <p>Coming Soon!</p>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function PostReviewPage() {}
 
killedBy: PostReviewPage tests renders without crashing
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Post a review for Menu Item/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
