[Killed] BlockStatement
src/main/pages/Moderate.js:6:24
 import { Navigate } from "react-router-dom";
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-const Moderate = () => {
-  const { data: currentUser } = useCurrentUser();
-
-  if (
-    !currentUser.loggedIn ||
-    (!hasRole(currentUser, "ROLE_ADMIN") &&
-      !hasRole(currentUser, "ROLE_MODERATOR"))
-  ) {
-    return <Navigate to="/" />;
-  }
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Moderation Page</h1>
-        <p>This page is accessible only to admins. (Placeholder)</p>
-      </div>
-    </BasicLayout>
-  );
-};
+const Moderate = () => {};
 
 export default Moderate;
killedBy: ModeratePage tests renders correctly for admin user
statusReason: Error: Unable to find an element with the text: Moderation Page. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
