[Killed] BlockStatement
main/components/Reviews/ReviewsTable.js:16:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/reviews/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all
killedBy: ReviewsTable tests Regular user buttons appear and work properly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/reviews/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ObjectLiteral
main/components/Reviews/ReviewsTable.js:38:5
       Header: "Item Id",
       accessor: "item.id",
     },
-    {
-      Header: "Item Name",
-      accessor: "item.name",
-    },
+    {},
     {
       Header: "Score",
killedBy: ReviewsTable tests Has the base column headers and content
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.js:40:17
     },
     {
       Header: "Item Name",
-      accessor: "item.name",
+      accessor: "",
     },
     {
killedBy: ReviewsTable tests Has the base column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-item.name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.js:43:15
       accessor: "item.name",
     },
     {
-      Header: "Score",
+      Header: "",
       accessor: "itemsStars",
       Cell: ({ value }) => "⭐".repeat(value),
killedBy: ReviewsTable tests Has the base column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Score. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.js:44:17
     },
     {
       Header: "Score",
-      accessor: "itemsStars",
+      accessor: "",
       Cell: ({ value }) => "⭐".repeat(value),
     },
killedBy: ReviewsTable tests Has the base column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-itemsStars"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/Reviews/ReviewsTable.js:45:13
     {
       Header: "Score",
       accessor: "itemsStars",
-      Cell: ({ value }) => "⭐".repeat(value),
+      Cell: () => undefined,
     },
     {
killedBy: ReviewsTable tests Renders stars icons and formatted date correctly
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ⭐⭐⭐⭐
Received:

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.js:48:15
       Cell: ({ value }) => "⭐".repeat(value),
     },
     {
-      Header: "Comments",
+      Header: "",
       accessor: "reviewerComments",
     },
killedBy: ReviewsTable tests Has the base column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Comments. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.js:49:17
     },
     {
       Header: "Comments",
-      accessor: "reviewerComments",
+      accessor: "",
     },
     {
killedBy: ReviewsTable tests Has the base column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-reviewerComments"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.js:52:15
       accessor: "reviewerComments",
     },
     {
-      Header: "Date Served",
+      Header: "",
       accessor: "dateItemServed",
       Cell: ({ value }) => (
killedBy: ReviewsTable tests Has the base column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Date Served. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/Reviews/ReviewsTable.js:54:13
     {
       Header: "Date Served",
       accessor: "dateItemServed",
-      Cell: ({ value }) => (
-        <span>{new Date(value).toLocaleDateString("en-US")}</span>
-      ),
+      Cell: () => undefined,
     },
     {
killedBy: ReviewsTable tests Renders stars icons and formatted date correctly
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1/2/2022
Received:

[Killed] ConditionalExpression
main/components/Reviews/ReviewsTable.js:64:7
     },
   ];
 
-  if (userOptions) {
+  if (false) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, "Reviewstable"));
     columns.push(
killedBy: ReviewsTable tests Regular user buttons appear and work properly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.js:65:31
   ];
 
   if (userOptions) {
-    columns.push(ButtonColumn("Edit", "primary", editCallback, "Reviewstable"));
+    columns.push(ButtonColumn("", "primary", editCallback, "Reviewstable"));
     columns.push(
       ButtonColumn("Delete", "danger", deleteCallback, "Reviewstable"),
killedBy: ReviewsTable tests Regular user buttons appear and work properly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.js:67:56
   if (userOptions) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, "Reviewstable"));
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "Reviewstable"),
+      ButtonColumn("Delete", "danger", deleteCallback, ""),
     );
   }
killedBy: ReviewsTable tests Regular user buttons appear and work properly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.js:67:20
   if (userOptions) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, "Reviewstable"));
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "Reviewstable"),
+      ButtonColumn("", "danger", deleteCallback, "Reviewstable"),
     );
   }
killedBy: MyReviewsIndexPage tests renders three reviews correctly for regular user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Reviews/ReviewsTable.js:71:25
     );
   }
 
-  if (moderatorOptions) {
-    columns.push(
-      ButtonColumn("Approve", "primary", approveCallback, "Reviewstable"),
-    );
-    columns.push(
-      ButtonColumn("Reject", "danger", rejectCallback, "Reviewstable"),
-    );
-  }
+  if (moderatorOptions) {}
 
   return <OurTable data={reviews} columns={columns} testid={"Reviewstable"} />;
killedBy: ReviewsTable tests Moderator buttons appear and work properly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-Approve-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.js:73:31
 
   if (moderatorOptions) {
     columns.push(
-      ButtonColumn("Approve", "primary", approveCallback, "Reviewstable"),
+      ButtonColumn("Approve", "", approveCallback, "Reviewstable"),
     );
     columns.push(
killedBy: ReviewsTable tests Moderator buttons appear and work properly
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.js:76:30
       ButtonColumn("Approve", "primary", approveCallback, "Reviewstable"),
     );
     columns.push(
-      ButtonColumn("Reject", "danger", rejectCallback, "Reviewstable"),
+      ButtonColumn("Reject", "", rejectCallback, "Reviewstable"),
     );
   }
killedBy: ReviewsTable tests Moderator buttons appear and work properly
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.js:80:61
     );
   }
 
-  return <OurTable data={reviews} columns={columns} testid={"Reviewstable"} />;
+  return <OurTable data={reviews} columns={columns} testid={""} />;
 }
 
killedBy: Moderate Page Tests renders reviews with approve/reject buttons for moderator
statusReason: Error: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-item.id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
