[Killed] StringLiteral
src/main/pages/Moderate.js:17:15
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/reviews/all"],
-    { method: "GET", url: "/api/reviews/all" },
+    { method: "", url: "/api/reviews/all" },
     [],
   );
killedBy: Moderate Page Tests handles error when backend is unavailable for moderator
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/reviews/all"
Received string:    "Error communicating with backend via  on /api/reviews/all"

[Killed] StringLiteral
src/main/pages/Moderate.js:17:27
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/reviews/all"],
-    { method: "GET", url: "/api/reviews/all" },
+    { method: "GET", url: "" },
     [],
   );
killedBy: Moderate Page Tests renders reviews with approve/reject buttons for moderator
statusReason: Error: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-item.id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/Moderate.js:22:5
   );
 
   const moderatorOptions =
-    hasRole(currentUser, "ROLE_ADMIN") ||
-    hasRole(currentUser, "ROLE_MODERATOR");
+    false;
 
   return (
killedBy: Moderate Page Tests renders reviews with approve/reject buttons for moderator
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-Approve-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/Moderate.js:22:5
   );
 
   const moderatorOptions =
-    hasRole(currentUser, "ROLE_ADMIN") ||
-    hasRole(currentUser, "ROLE_MODERATOR");
+    true;
 
   return (
killedBy: Moderate Page Tests does NOT render approve/reject buttons for regular user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-primary" data-testid="Reviewstable-cell-row-0-col-Approve-button" type="button">Approve</button> instead

[Killed] StringLiteral
src/main/pages/Moderate.js:23:26
 
   const moderatorOptions =
     hasRole(currentUser, "ROLE_ADMIN") ||
-    hasRole(currentUser, "ROLE_MODERATOR");
+    hasRole(currentUser, "");
 
   return (
killedBy: Moderate Page Tests renders reviews with approve/reject buttons for moderator
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-Approve-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
