[Killed] BlockStatement
main/pages/MyReviews/MyReviewsIndexPage.js:8:46
 import ReviewsTable from "main/components/Reviews/ReviewsTable";
 import { useCurrentUser, hasRole } from "main/utils/currentUser";
 
-export default function MyReviewsIndexPage() {
-  const currentUser = useCurrentUser();
-
-  const {
-    data: reviews,
-    error: _error,
-    status: _status,
-  } = useBackend(
-    // Stryker disable next-line all : don't test internal caching of React Query
-    ["/api/reviews/reviewer/all"],
-    { method: "GET", url: "/api/reviews/all" },
-    [],
-  );
-
-  const userOptions = hasRole(currentUser, "ROLE_USER");
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>My Reviews</h1>
-        <ReviewsTable reviews={reviews} userOptions={userOptions} />
-      </div>
-    </BasicLayout>
-  );
-}
+export default function MyReviewsIndexPage() {}
 
killedBy: MyReviewsIndexPage tests renders three reviews correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-item.id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
