[Killed] BlockStatement
main/pages/Reviews/ReviewsPage.js:6:39
 import { useParams } from "react-router-dom";
 import ReviewsTable from "main/components/Reviews/ReviewsTable";
 
-export default function ReviewsPage() {
-  const { itemid } = useParams();
-  const {
-    data: reviews,
-    error: _error,
-    status: _status,
-  } = useBackend(
-    // Stryker disable next-line all : don't test internal caching of React Query
-    ["/api/reviews/all"],
-    { method: "GET", url: "/api/reviews/all" },
-    [],
-  );
-
-  const filteredReviews =
-    reviews?.filter((review) => review.item.id === Number(itemid)) || [];
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Reviews for Menu Item {itemid}</h1>
-        <ReviewsTable reviews={filteredReviews} />
-      </div>
-    </BasicLayout>
-  );
-}
+export default function ReviewsPage() {}
 
killedBy: ReviewsPage tests renders reviews filtered by itemid
statusReason: Error: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-item.id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ObjectLiteral
main/pages/Reviews/ReviewsPage.js:15:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/reviews/all"],
-    { method: "GET", url: "/api/reviews/all" },
+    {},
     [],
   );
killedBy: ReviewsPage tests renders reviews filtered by itemid
statusReason: Error: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-item.id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Reviews/ReviewsPage.js:20:33
   );
 
   const filteredReviews =
-    reviews?.filter((review) => review.item.id === Number(itemid)) || [];
+    reviews?.filter((review) => true) || [];
 
   return (
killedBy: ReviewsPage tests renders reviews filtered by itemid
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="Reviewstable-cell-row-1-col-item.id" role="cell">8</td> instead

[Killed] MethodExpression
main/pages/Reviews/ReviewsPage.js:20:5
   );
 
   const filteredReviews =
-    reviews?.filter((review) => review.item.id === Number(itemid)) || [];
+    reviews || [];
 
   return (
killedBy: ReviewsPage tests renders reviews filtered by itemid
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="Reviewstable-cell-row-1-col-item.id" role="cell">8</td> instead
