[Killed] BlockStatement
src/main/utils/Reviews.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/reviews/reviewer",
-    method: "DELETE",
-    params: {
-      id: cell.row.original.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: MyReviewsIndexPage tests what happens when you click delete, user
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Review deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
src/main/utils/Reviews.js:10:10
 
 export function cellToAxiosParamsDelete(cell) {
   return {
-    url: "/api/reviews/reviewer",
+    url: "",
     method: "DELETE",
     params: {
killedBy: MyReviewsIndexPage tests what happens when you click delete, user
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Review deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
