[Timeout] BlockStatement
main/pages/Reviews/PostReviewPage.js:29:44
 
   const itemName = menuItems.name;
 
-  const submitReview = async (formData) => {
-    try {
-      await axios.post("/api/reviews/post", null, {
-        params: {
-          itemId: id,
-          reviewerComments: formData.reviewerComments,
-          itemsStars: formData.itemsStars,
-          dateItemServed: formData.dateItemServed,
-        },
-      });
-      // Stryker disable next-line all : itemName will be defined
-      toast(`Review submitted for ${itemName}`);
-      navigate("/myreviews");
-    } catch (err) {
-      toast.error(
-        `Error submitting review: ${err.response?.data?.error || err.message}`,
-      );
-    }
-  };
+  const submitReview = async (formData) => {};
 
   return (

[Timeout] BlockStatement
main/pages/Reviews/PostReviewPage.js:30:9
   const itemName = menuItems.name;
 
   const submitReview = async (formData) => {
-    try {
-      await axios.post("/api/reviews/post", null, {
-        params: {
-          itemId: id,
-          reviewerComments: formData.reviewerComments,
-          itemsStars: formData.itemsStars,
-          dateItemServed: formData.dateItemServed,
-        },
-      });
-      // Stryker disable next-line all : itemName will be defined
-      toast(`Review submitted for ${itemName}`);
-      navigate("/myreviews");
-    } catch (err) {
+    try {} catch (err) {
       toast.error(
         `Error submitting review: ${err.response?.data?.error || err.message}`,

[Timeout] BlockStatement
main/pages/Reviews/PostReviewPage.js:42:19
       // Stryker disable next-line all : itemName will be defined
       toast(`Review submitted for ${itemName}`);
       navigate("/myreviews");
-    } catch (err) {
-      toast.error(
-        `Error submitting review: ${err.response?.data?.error || err.message}`,
-      );
-    }
+    } catch (err) {}
   };
 
